Tekla Open API Reference for Tekla Structures 2025
Arc Constructor (ViewBase, Point, Point, Point, Arc.ArcAttributes)
 Creates a new arc instance with the given three points and specified attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Arc(
	ViewBase inView,
	Point StartPoint,
	Point EndPoint,
	Point CenterPoint,
	Arc.ArcAttributes inAttributes
)
Public Sub New (
	inView As ViewBase,
	StartPoint As Point,
	EndPoint As Point,
	CenterPoint As Point,
	inAttributes As Arc.ArcAttributes
)
Parameters
inView
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
StartPoint
Type: Tekla.Structures.Geometry3d.Point
The start point to be used.
EndPoint
Type: Tekla.Structures.Geometry3d.Point
The end point to be used.
CenterPoint
Type: Tekla.Structures.Geometry3d.Point
The center point to be used.
inAttributes
Type: Tekla.Structures.Drawing.Arc.ArcAttributes
The arc attributes to be used.
See Also
Reference
Arc Class
Arc Overload
Tekla.Structures.Drawing Namespace